In [1]:
import pandas as pd
import numpy as np

In [46]:
students = pd.DataFrame({'date':['2018-01-01', '2018-01-02', '2018-01-03'],
                        'student_id':[1, 2, 3],
                        'attendance':[True, False, False]})

In [47]:
students

   attendance        date  student_id
0        True  2018-01-01           1
1       False  2018-01-02           2
2       False  2018-01-03           3

In [48]:
students['date'] = pd.to_datetime(students['date'])

In [49]:
students.set_index('date')

            attendance  student_id
date
2018-01-01        True           1
2018-01-02       False           2
2018-01-03       False           3

In [50]:
students

   attendance       date  student_id
0        True 2018-01-01           1
1       False 2018-01-02           2
2       False 2018-01-03           3

In [51]:
students[students['date'] == '2018-01-01']['attendance'].mean()

1.0

In [52]:
dimension = pd.DataFrame({'student_id':[1, 2, 3, 4, 5, 6],
            'school_id':[1, 1, 2, 2, 3, 4],
            'grade_level':[5, 5, 5, 5, 4, 2],
            'date_of_birth':['1988-01-01', '1988-01-02', '1988-01-03', '1988-01-03', '1988-01-05', '1988-01-08'],
            'hometown':['everett', 'everett', 'everett', 'seattle', 'bellevue', 'everett']})

In [53]:
dimension['date_of_birth'] = pd.to_datetime(dimension['date_of_birth'])

In [54]:
dimension

  date_of_birth  grade_level  hometown  school_id  student_id
0    1988-01-01            5   everett          1           1
1    1988-01-02            5   everett          1           2
2    1988-01-03            5   everett          2           3
3    1988-01-03            5   seattle          2           4
4    1988-01-05            4  bellevue          3           5
5    1988-01-08            2   everett          4           6

In [55]:
dimension.groupby('grade_level').count()

             date_of_birth  hometown  school_id  student_id
grade_level
2                        1         1          1           1
4                        1         1          1           1
5                        4         4          4           4

In [56]:
merged = students.merge(dimension, how='left', on='student_id')

In [57]:
merged

,attendance,date,student_id,date_of_birth,grade_level,hometown,school_id
0,True,2018-01-01,1,1988-01-01,5,everett,1
1,False,2018-01-02,2,1988-01-02,5,everett,1
2,False,2018-01-03,3,1988-01-03,5,everett,2

In [60]:
merged.groupby('school_id').mean()['attendance']

school_id
1    0.5
2    0.0
Name: attendance, dtype: float64

In [45]:
merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 0 to 2
Data columns (total 7 columns):
attendance       3 non-null bool
date             3 non-null datetime64[ns]
student_id       3 non-null int64
date_of_birth    3 non-null datetime64[ns]
grade_level      3 non-null int64
hometown         3 non-null object
school_id        3 non-null int64
dtypes: bool(1), datetime64[ns](2), int64(3), object(1)
memory usage: 171.0+ bytes

In [62]:
{'id':[1, 2, 3, 2, 2, 2, 3, 3, 3, 1, 1, 2, 3, 2, 2, 2, 1, 3, 2, 1],
 'type':['m', 'w', 'm', 'm', 'w', 'm', 'm', 'w', 'm', 'm', 'w', 'm', 'm', 'w', 'm', 'm', 'w', 'm', 'w'],
 'login_time':[pd.date_range('1/1/2011', periods=19, freq="D")]}

{'id': [1, 2, 3, 2, 2, 2, 3, 3, 3, 1, 1, 2, 3, 2, 2, 2, 1, 3, 2, 1],
 'login_time': [DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
                 '2011-01-05', '2011-01-06', '2011-01-07', '2011-01-08',
                 '2011-01-09', '2011-01-10', '2011-01-11', '2011-01-12',
                 '2011-01-13', '2011-01-14', '2011-01-15', '2011-01-16',
                 '2011-01-17', '2011-01-18', '2011-01-19'],
                dtype='datetime64[ns]', freq='D')],
 'type': ['m',
  'w',
  'm',
  'm',
  'w',
  'm',
  'm',
  'w',
  'm',
  'm',
  'w',
  'm',
  'm',
  'w',
  'm',
  'm',
  'w',
  'm',
  'w']}

In [80]:
dates = pd.date_range('1/1/2011', periods = 5000, freq = 'H')

In [81]:
dates = pd.DataFrame(dates)

In [82]:
logins = dates.copy()

In [91]:
logins['user_id'] = logins[0].apply(lambda x: np.random.randint(1, high=4))

In [94]:
logins = logins.set_index(0)

In [96]:
logins.head(5)

                     user_id
0
2011-01-01 00:00:00        2
2011-01-01 01:00:00        2
2011-01-01 02:00:00        3
2011-01-01 03:00:00        1
2011-01-01 04:00:00        1

In [153]:
this_week = logins['2011-01-01':'2011-01-07'].copy()

In [154]:
this_week.index = this_week.index.day

In [157]:
this_week['day'] = this_week.index

In [145]:
this_week_distinct = this_week.drop_duplicates()

In [158]:
days_of_week = this_week_distinct.groupby('user_id').count()

In [167]:
days_of_week[days_of_week['day'] == 7].index.values

array([1, 2, 3])